# Задание №3 Задача №3

# Напишите программу, которая будет преобразовывать десятичное число
# в двоичное.
# Без использования встроенной функции преобразования, без строк.
# in 88
# out 1011000
# in  11
# out 1011

n = int(input("Enter the number:  "))
binNum = [0]*32     # Массив на 32 элемента с "0" значениями
i=0
while n > 0:        # Получение 2-ого числа
    binNum[i] = n % 2
    n = int (n / 2 )
    i+= 1
j = i - 1
while j >= 0:       # Вывод 2-ого числа - вывод массива в обратном порядке
    binNum[i] = n % 2
    print (binNum[j], end = " ")
    j=j-1
print (f" - its binary number") 


