# Задание 5 Задача 1
# Напишите программу, удаляющую из текста все слова, 
# содержащие "абв". В тексте используется разделитель пробел.

txt = 'авб абв бав абв вба бав вба абв абв абв'
print(f"Исходный текст: {txt}")
find_txt = "абв"
lst = [i for i in txt.split() if find_txt not in i]
print(f'Результат: {" ".join(lst)}')